app/controllers/bases_controller.rb

  def create
    content = Content.create(
        :title => params[:title],
        :subtitle => params[:subtitle],
        :page_id => params[:page_id],
        :page_order => params[:page_order],
        :page_type => params[:page_type]
    )

    if content.page_type == 'normal'
      if params[:content_text]
        content_array = JSON.parse(params[:content_text])
        content_array.each do |text|
          content.content_texts.create(
              :body_text => text['text']
          )
        end
      end

      if params[:content_image]
        image_array = JSON.parse(params[:content_image])
        image_array.each do |image|
          content.content_images.create(
              :image_uri => image['image_uri']
          )
---
INSERT INTO "contents" ("page_id", "page_order", "page_type", "subtitle", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["page_id", "page2"], ["page_order", 0], ["page_type", "normal"], ["subtitle", "subtitle2"], ["title", "title2"]]
INSERT INTO "content_texts" ("body_text", "content_id") VALUES ($1, $2) RETURNING "id"  [["body_text", "text number 1"], ["content_id", 1]]
INSERT INTO "content_images" ("content_id", "image_uri") VALUES ($1, $2) RETURNING "id"  [["content_id", 2], ["image_uri", "image8"]]

      if params[:content_video]
        video_array = JSON.parse(params[:content_video])
        video_array.each do |video|
          content.content_videos.create(
              :video_uri => video['video_uri']
          )
---
INSERT INTO "content_videos" ("content_id", "video_uri") VALUES ($1, $2) RETURNING "id"  [["content_id", 3], ["video_uri", "video1"]]

  def index
    @content = Content.find_by_page_order(0)
    @page_list = []
    Content.all.sort_by{|i| i.page_order}.map{|i| @page_list << {:page_id => i.page_id, :title => i.title, :page_order => i.page_order}}
---
SELECT "contents".* FROM "contents" WHERE "contents"."page_order" = 0 LIMIT 1
SELECT "contents".* FROM "contents" LIMIT 1

  def show
    @content = Content.find_by_page_id(params[:id])
    @max = Content.maximum("page_order")
---
SELECT "contents".* FROM "contents" WHERE "contents"."page_id" = 'second' LIMIT 1
SELECT "contents".* FROM "contents"
SELECT MAX("contents"."page_order") AS max_id FROM "contents"

  def show_by_page_order
    @content = Content.find_by_page_order(params[:page_order])
    @max = Content.maximum("page_order")
---
SELECT "contents".* FROM "contents" WHERE "contents"."page_order" IS NULL LIMIT 1
SELECT "contents".* FROM "contents"
SELECT MAX("contents"."page_order") AS max_id FROM "contents"