app/views/bases/index.html.erb

SELECT "content_texts".* FROM "content_texts" WHERE "content_texts"."content_id" = 3
SELECT "contents".* FROM "contents" LIMIT 1
---
<div id="main">
  <% @content.content_texts.each do |text| %>

SELECT "content_images".* FROM "content_images" WHERE "content_images"."content_id" = 4
---
  <% end %>
  <% @content.content_images.each do |image| %>

SELECT "content_videos".* FROM "content_videos" WHERE "content_videos"."content_id" = 1
---
  <div id="video">
    <% @content.content_videos.each do |video| %>