app/views/bases/show.html.erb

SELECT "content_texts".* FROM "content_texts" WHERE "content_texts"."content_id" = 5
SELECT "contents".* FROM "contents"
---
<div id="main">
  <% @content.content_texts.each do |text| %>

SELECT "content_images".* FROM "content_images" WHERE "content_images"."content_id" = 5
---
  <% end %>
  <% @content.content_images.each do |image| %>

SELECT "content_videos".* FROM "content_videos" WHERE "content_videos"."content_id" = 24
SELECT COUNT(*) FROM "content_videos" WHERE "content_videos"."content_id" = 5
---
  <% end %>
  <% unless @content.content_videos.empty? %>